and88x/PIC-MikroC-Assembler/Allegro ACS758 Current Sensor C18/Allegro_ACS758_PIC18F45K22.c
#define VERSION              12      
//#define PLUS                  1      

#include <xc.h>
#include <pic18f45k22.h>
#include "bwcd_def.h"

#pragma config IESO=OFF, FOSC=8, PRICLKEN=ON, FCMEN=OFF, PLLCFG=OFF
#pragma config BOREN=SBORDIS, BORV=285, PWRTEN=ON
#pragma config WDTPS=512, WDTEN=3
//#pragma config CP = ON          //  code protection please try to find propper solution

const unsigned char cright_string [] = {"Capital weld cleaners"};
const unsigned char nvinit_start_string [] = {"Hardware initialize"};
const unsigned char nvinit_end_string [] = {"... Initialized"};
const unsigned char nvOK_string [] = {"Welcome"};

// Global variables

unsigned char errorstate;
unsigned char most_recent_error;
unsigned char sensors;

const unsigned int climit []=
                   { 0, 400,1000,2400,5000,7200,11000,15000,20000,25000,32000,32000};
                   //0, 5,  10,  15,  20,  25,  30,   35,   40,   45,   50,
// lookup current limits from power setting

unsigned char adc_channel;
unsigned char txchar[4];
unsigned char rxchar[16];
unsigned char rxchar_index;
unsigned char timeout;          // universal timeout counter

#define BRIDGE_IS_OFF   ((LATD & 0x02) == 0)
#define BRIDGE_ON       LATD |= 0x02; bridge_off_flag = 0
#define BRIDGE_OFF      LATD &= ~0x1e; LATC &= ~0x02
#define RELAYS_ON       LATD |= 0x01
#define RELAYS_OFF      LATD &= ~0x01
#define ALIVE_LED_ON    LATA |= 0x80
#define ALIVE_LED_OFF   LATA &= ~0x80
#define ALIVE_LED_TOGGLE LATA ^= 0x80
#define RED_LED_ON      LATA |= 0x30
#define RED_LED_OFF     LATA &= ~0x30

unsigned char faults;
#define FAULT_NONE     0x00
#define FAULT_TEMP1    0x01   /* thermistor#1 (RB1=AN10) too hot */
#define FAULT_TEMP2    0x02   /* thermistor#2 (RB2=AN8) too hot */
#define FAULT_TEMP3    0x04   /* thermistor#3 (RC4=AN16) too hot */
#define FAULT_CURRENT  0x08   /* current too high */

#define FAULT_ZERO     0x10   /* too long between zero crossings */
#define FAULT_BRIDGE   0x20   /* current flowing with bridge off */
#define FAULT_COMP     0x40   /* hardware comparator triggered */
#define FAULT_FSWITCH  0x80   /* MARK mode with no footswitch present */

#define FAULT_OVERTEMP 0x07   /* all over-temp faults*/
#define FAULT_HARDWARE 0x70   /* all serious hardware faults */

#define LEFT_OFF      LATD &= ~0x18
#define LEFT_TOP_ON   LATD &= ~0x18; LATD |= 0x08
#define LEFT_BOT_ON   LATD &= ~0x18; LATD |= 0x10

#define RIGHT_OFF     LATC &= ~0x02; LATD &= ~0x04
#define RIGHT_TOP_ON  LATD &= ~0x04; LATC |= 0x02
#define RIGHT_BOT_ON  LATC &= ~0x02; LATD |= 0x04

// ADC values for Beta=3380 1k pullup (TH1=AN10,TH2=AN8)
#define CELCIUS_100  517
#define CELCIUS_90   581
#define CELCIUS_85   613
#define CELCIUS_80   645
#define CELCIUS_70   709
#define CELCIUS_60   770
#define CELCIUS_50   825
#define CELCIUS_40   873
#define CELCIUS_30   913
#define CELCIUS_25   930

// ADC values for Beta=3610 1k pullup (TH3=AN16)
#define TH3_CELCIUS_100  475
#define TH3_CELCIUS_90   545
#define TH3_CELCIUS_85   581
#define TH3_CELCIUS_80   617
#define TH3_CELCIUS_70   688
#define TH3_CELCIUS_60   770
#define TH3_CELCIUS_50   825
#define TH3_CELCIUS_40   873
#define TH3_CELCIUS_30   912
#define TH3_CELCIUS_25   930

#define CURRENT_THRESHOLD   20          /* threshold for detecting current flowing */
#define CURRENT_100A        511         /* adc sample for 100A instantaneous */
#define CURRENT_75A         383         /* adc sample for 75A instantaneous */
#define CURRENT_50A         256         /* adc sample for 50A instantaneous */

#ifdef PLUS
#define MAX_CURRENT_SAMPLE  CURRENT_50A  /* max allowed adc sample   */
#else
#define MAX_CURRENT_SAMPLE  CURRENT_100A  /* max allowed adc sample for  */
#endif


volatile unsigned int faultcount;
volatile unsigned int inhibit_count;

unsigned int ui_data;
unsigned long l_data;
unsigned int ui_glob;
unsigned int status;
#define  STATUS_UNIT_ON             0x0001
#define  STATUS_OUTPUT_ON           0x0002
#define  STATUS_DISPLAY_ON          0x0004
#define  STATUS_CURRENT_AC          0x0008
#define  STATUS_CURRENT_FLOWING     0x0010
#define  STATUS_CURRENT_LIMITING    0x0020
#define  STATUS_USB_PRESENT         0x0040
#define  STATUS_FSWITCH_PRESENT     0x0080
#define  STATUS_FSWITCH_PRESSED     0x0100
#define  STATUS_TIMER_STARTED       0x0200
#define  STATUS_TIMER_ACTIVE        0x0400

unsigned int current_total;
unsigned int current_limit;
unsigned char current_index;
unsigned int current[100];
unsigned int us250counter;
unsigned char mscounter;
unsigned char ms64;
unsigned char ms256_counter;
unsigned char minute_flag;
unsigned char printing;
unsigned char zero_cross_timeout;
unsigned char mode;


#define FLASH1Hz   0x0e
#define FLASH2Hz   0x04
#define FLASH4Hz   0x02

#define MODE_STANDBY    'S'
#define MODE_CLEANING   'C'
#define MODE_POLISHING  'P'
#define MODE_MARK5      '1'
#define MODE_MARK10     '2'
#define MODE_MARK15     '3'
#define MODE_MANUAL     '0'
#define MODE_MARKING    0x20  /* i.e. (mode&MARKING) true for all MARK modes && false for all other modes */
#define MAX_MARK_POWER  6     /* limit power to setting 6 = 30A for marking */
#ifdef PLUS
#define MAX_POWER       6      /* limit power to setting 6 = 30A for PLUS */
#else
#define MAX_POWER       20     /* limit power to setting 10 = 50A for PROPLUS */
#endif


unsigned char errorno;
unsigned char rising_edge_flag; // set at zero crossing when Power1 is rising ref Power3
unsigned char bridge_off_flag; // set if bridge is switched off when measuring current
volatile unsigned char new_key;
unsigned char keypadcount;
unsigned int current_sample;
unsigned char power_setting;

unsigned int adc_RA2;     // current sensor
unsigned int adc_RB1;     // thermistor#1
unsigned int adc_RB2;     // thermistor#2
unsigned int adc_RC4;     // thermistor#3
unsigned int adc_RC6;     // footswitch present (Tx1)
unsigned int adc_RC7;     // footswitch pressed (Rx1)

unsigned int sampleno;
unsigned int sample;
unsigned char adc_invalid_flag;
signed char filteredRB0;


void initialise (void);
void delayms (unsigned char millis);
void check_keypad (void);
void do_initialising (void);
void nv_check (void);
void nv_init (void);
unsigned int nv_read (unsigned char nvadd);
void nv_write (unsigned char nvadd, unsigned int nvdata);
void nv_save_mode (void);
void nv_increment (unsigned char nvadd);
void nv_restore_mode (void);
void nv_restore_marking_mode (void);
void nv_save_power (void);
void nv_restore_power (void);
void putSP1 (unsigned char uc_out);
void putch1 (unsigned char uc_out);
void putch2 (unsigned char uc_out);
void crlf1 (void);
void crlf2 (void);
void send1_string (const char *str);
void send1_ui (unsigned int ui_numb);
void print1_si (signed int si_numb);
void print1_hex (unsigned char uc_numb);
void print1_error(void);
void print1_current(void);
void print1_adcs (void);
void print1_nvdata (void);
void print1_nvsysdata(void);
void do_adc (void);
void oled_hello (void);
void oled_blank (void);
void oled_digits (unsigned char nums);
void oled_version (void);
void check_footswitch (void);


void main(void)
{
unsigned int loopcounter;
unsigned char old_key;
unsigned char old_command;
unsigned char new_command;
unsigned int mark_timer;
unsigned char old_timer;
unsigned char nv_base;
unsigned char nv_offset;
unsigned char old_faults;

  initialise();
  BRIDGE_OFF;
  bridge_off_flag = 0;
  status = 0;
  RED_LED_OFF;
  ALIVE_LED_ON;
  faults = 0;
  old_faults = 0;
  mode = MODE_STANDBY;     // default to standby
  rxchar_index = 0;
  new_key = 0;
  old_key = 0;
  old_command = 0;
  new_command = 0;
  printing = 1;
  errorno = 0;
  zero_cross_timeout = 100;  // should never exceed 25ms without zero crossing
  loopcounter = 0;
  power_setting = 0;
  current_limit = climit[power_setting];
  sampleno = 0;
  filteredRB0 = 0;
 
  INTCONbits.PEIE = 1;
  INTCONbits.GIE = 1;      // enable interrupts

