and88x/PIC-MikroC-Assembler/Allegro ACS758 Current Sensor C18/Allegro_ACS758_PIC18F45K22.c
  faultcount = 0x007f;
  while (faultcount != 0)  ;          // pause

  putch2 ('D');
  putch2 ('C');
  putch2 (0);    // disable OLED config display at startup
  delayms (5);
 // oled_blank();
  delayms (50);
  crlf1();
  putch1 ('V');
  send1_ui(VERSION);
  crlf1();
  send1_string(cright_string);
  crlf1();
  //oled_blank();
  //oled_version();
  nv_check();
  delayms (250);    // brief pause showing version
  putch2 ('D');
  putch2 ('C');
  putch2 (0);    // disable OLED config display at startup
  delayms (50);
 // oled_hello();

  delayms (250);    // pause showing HELLO
  delayms (250);
  delayms (250);
  delayms (250);
  delayms (250);
 // oled_blank();
  delayms (250);
  CLRWDT();    // kick watchdog (xc.h)
 
//-------------------

  ADCON0bits.CHS = 2;  // select channel 2 (current)
  ADCON0bits.ADON = 1; // adc enabled
  ADCON0bits.GO = 1;   // adc started
// after startup messages have been sent disable serial port and start checking
// footswitch socket
  TXSTA1bits.TXEN = 1;  // disable Tx1
  RCSTA1bits.SPEN = 1;  // disable serial port
  TRISC = 0x11;         // configures RC6 & RC7 as outputs
  LATC = 0x40;          // start footswitch detection with RC7 low and RC6 high

  mscounter = 0;        // ensures check_footswitch is not called until all adcs read
  ms256_counter = 0;
  minute_flag = 0;

  while(1)
  {                             // main loop starts here
    if (ADCON0bits.GO == 0)    // if previous conversion complete
    {
       do_adc ();               // updte adcs
    }

     if ((faults & FAULT_CURRENT) != 0)
     {
       if (faultcount == 0)
       {
           faults &= ~FAULT_CURRENT; // clear FAULT_CURRENT after a while with no reports
       }
     }
     if ((faults & (FAULT_HARDWARE|FAULT_OVERTEMP)) != 0) // if hardware fault or overtemp - switch off output
     {
         BRIDGE_OFF;
         RED_LED_OFF;
         status &= ~STATUS_OUTPUT_ON;
         mode = MODE_STANDBY;
         power_setting = 0;
         current_limit = climit[power_setting];
         if (old_faults != faults)              // check for new faults
         {
           old_faults = faults;
           if (faults == FAULT_BRIDGE) nv_increment (NV_ADD_BRIDGE);
           else if (faults == FAULT_ZERO) nv_increment (NV_ADD_ZERO);
           else if (faults == FAULT_TEMP1) nv_increment (NV_ADD_TEMP1);
           else if (faults == FAULT_TEMP2) nv_increment (NV_ADD_TEMP2);
           else if (faults == FAULT_TEMP3) nv_increment (NV_ADD_TEMP3);
         }
     }
     if (old_timer != ms64)  // every 64ms approx
     {
       old_timer = ms64;
       CLRWDT();    // kick watchdog (xc.h)
       ALIVE_LED_TOGGLE;

       check_footswitch();
#ifdef PLUS
         faults &= ~FAULT_FSWITCH;      // PLUS has no footswitch so no footswitch fault
         if ((faults & (FAULT_HARDWARE|FAULT_OVERTEMP)) == 0)  // if no serious faults
         {
            status |= STATUS_OUTPUT_ON;    // enable output
         }
#else
       if ((mode >= MODE_MANUAL) && (mode <= MODE_MARK15) && ((status & STATUS_FSWITCH_PRESENT) == 0))
       {
         faults |= FAULT_FSWITCH;   // if any marking mode but no footswitch present then footswitch fault
       }
       else
       {
         faults &= ~FAULT_FSWITCH;      // otherwise no footswitch fault
       }

       if ((mode >= MODE_MANUAL) && (mode <= MODE_MARK15))  // if any marking mode
       {
         if (status & STATUS_FSWITCH_PRESENT)  // and footswitch present
         {
           if (((faults & (FAULT_HARDWARE|FAULT_OVERTEMP)) == 0) && (status & STATUS_FSWITCH_PRESSED))
           {                           // if no serious faults and footswitch pressed
             if ((status & STATUS_TIMER_STARTED) == 0)  // and timer not started
             {
               ms64 = 0;
               old_timer = ms64;
               status |= STATUS_TIMER_STARTED;
               status |= STATUS_TIMER_ACTIVE;
               status |= STATUS_OUTPUT_ON;
               if (mode == MODE_MARK5)
               {
                 mark_timer = 80;       // start timimg 5s
               }
               else if (mode == MODE_MARK10)
               {
                 mark_timer = 160;       // start timimg 10s
               }
               else if (mode == MODE_MARK15)
               {
                 mark_timer = 240;       // start timimg 15s
               }
               else
               {
                 mark_timer = 960;      // manually timed, but max time = 60s
               }
             }
             else
             {
               if (mark_timer > 0)
               {
                  mark_timer -= 1;
               }
               else
               {
                 status &= ~STATUS_TIMER_ACTIVE;
                 status &= ~STATUS_OUTPUT_ON;
               }
             }
           }
           else   //    else (if no serious faults and footswitch pressed)
           {
             status &= ~STATUS_TIMER_STARTED;
             status &= ~STATUS_TIMER_ACTIVE;
             status &= ~STATUS_OUTPUT_ON;
           }
         }
       }
#endif

       if (minute_flag != 0)
       {
           minute_flag = 0;
           if (mode == MODE_CLEANING) nv_base = NV_ADD_CLEANING;
           else if (mode == MODE_POLISHING) nv_base = NV_ADD_POLISHING;
           else if (mode == MODE_MARK5) nv_base = NV_ADD_MARK5;
           else if (mode == MODE_MARK10) nv_base = NV_ADD_MARK10;
           else if (mode == MODE_MARK15) nv_base = NV_ADD_MARK15;
           else if (mode == MODE_MANUAL) nv_base = NV_ADD_MANUAL;
           nv_offset = ((power_setting - 1) & 0xfe);  // force offset to even value
           if (nv_offset > 0x08) nv_offset = 0x00;    // valid fom 0x00 - 0x08
           nv_base += nv_offset;
           if (mode != MODE_STANDBY) nv_increment (nv_base);
       }
     }

     if (us250counter > 0x0800)  // twice per sec
     {
       us250counter = 0;
       print1_error();
       print1_current();
       print1_adcs();
     }
     if (rxchar_index != 0)
     {
       new_command = rxchar[rxchar_index];
     }
     if (old_key != new_key)
     {
       old_key = new_key;
       new_command = new_key;
     }

     if (old_command != new_command)
     {
       old_command = new_command;

       if (new_command == 0) // ignore - happens when keypad is released
       {
       }
       else if ((new_command == 'T')||(new_command == 't')) // Toggle power
       {
         if ((status & STATUS_UNIT_ON) != 0)
         {
           status = 0;
           faults = 0;
           mode = MODE_STANDBY;
           power_setting = 0;     // allow zero power when in standby
           current_limit = climit[power_setting];   // default limit approx 1A
           BRIDGE_OFF;
           RED_LED_OFF;
           status &= ~STATUS_OUTPUT_ON;
           putch1 (new_command);
         }
         else
         {
           status |= STATUS_UNIT_ON;
           BRIDGE_OFF;
           RED_LED_OFF;
           faults = 0;
           putch1 (new_command);
           nv_restore_mode ();      //restore most recently used mode
           nv_restore_power ();     //restore most recently used power_setting
           current_limit = climit[power_setting];
           if ((mode == MODE_CLEANING) || (mode == MODE_POLISHING))
           {
               status |= STATUS_OUTPUT_ON;
           }
         }
       }
       else if (new_command == 'H')           // Higher power
       {
         if ((status & STATUS_UNIT_ON) != 0)
         {
           power_setting += 1;
           if (power_setting > MAX_POWER) power_setting = MAX_POWER;
           if ((mode >= MODE_MANUAL) && (mode <= MODE_MARK15))
           {
             if (power_setting > MAX_MARK_POWER) power_setting = MAX_MARK_POWER;
           }
           nv_save_power();
           current_limit = climit[power_setting];
           putch1 ('0' + power_setting);                              
          // putch2 ('0' + climit); 
           // putch1 (ADRESH);  
           
         //  putch1(current_limit);
  
