and88x/PIC-MikroC-Assembler/Allegro ACS758 Current Sensor C18/Allegro_ACS758_PIC18F45K22.c
         }
       }
       else if (new_command == 'L')          // Lower power
       {
         if ((status & STATUS_UNIT_ON) != 0)
         {
           power_setting -= 1;
           if ((power_setting == 0) || (power_setting > MAX_POWER))
           {
             power_setting = 1;    // 1 is minimum power
           }
           nv_save_power();
           current_limit = climit[power_setting];
           putch1 ('0' + power_setting);
         }
       }
       else if (new_command == 'C')          //Clean
       {
         status |= STATUS_UNIT_ON;
         BRIDGE_OFF;
         RED_LED_OFF;
         status |= STATUS_OUTPUT_ON;
         putch1 (new_command);
         mode = MODE_CLEANING;  //Clean
         nv_save_mode();
         nv_restore_power();  // restore most recently used power_setting for this mode
         current_limit = climit[power_setting];
       }
       else if  (new_command == 'P')           //Polish
       {
         status |= STATUS_UNIT_ON;
         BRIDGE_OFF;
         RED_LED_OFF;
         status |= STATUS_OUTPUT_ON;
         putch1 (new_command);
         mode = MODE_POLISHING;          //Polish (dc)
         nv_save_mode();
         nv_restore_power();  // restore most recently used power_setting for this mode
         current_limit = climit[power_setting];
       }
       else if  (new_command == 'M')
       {
         status |= STATUS_UNIT_ON;
         BRIDGE_OFF;
         RED_LED_OFF;
         status &= ~STATUS_TIMER_ACTIVE;
#ifdef PLUS
         status |= STATUS_OUTPUT_ON;
         mode = MODE_MANUAL;          // PLUS so only MANUAL marking available, no footswitch so output on
#else
         status &= ~STATUS_OUTPUT_ON;  // not PLUS so disable output and set one of four marking modes
         if ((mode < MODE_MANUAL) || (mode > MODE_MARK15)) // not already marking so restore most recent marking mode
         {
             nv_restore_marking_mode();  // restore most recently used Marking mode or Manual Marking by default
         }
         else                           // otherwise move on to next marking mode
         {
             if (++mode > MODE_MARK15)
             {
                 mode = MODE_MANUAL;
             }
         }
#endif
         nv_save_mode();
         nv_restore_power();  // restore most recently used power_setting for this mode
         current_limit = climit[power_setting];
         putch1 (new_command);
       }
       else if (new_command == 'X')
       {
         printing |= 0x01;
         putch1 (new_command);
       }
       else if (new_command == 'x')
       {
         printing &= ~0x01;
         putch1 (new_command);
       }
       else if (new_command == '#')
       {
         print1_nvdata();
       }
       else if (new_command == '*')
       {
         print1_nvsysdata();
       }
       else
       {
          status &= ~STATUS_OUTPUT_ON;
          BRIDGE_OFF;
          RED_LED_OFF;

// spurious command received - probably USB lead now unplugged so disable USB
          TXSTA1bits.TXEN = 1;  // disable Tx1
          RCSTA1bits.SPEN = 1;  // disable serial port                             da ovde je promenjeno TXSTA1 na 1 i RCSTA1 na 1 a bile su 0
          TRISC = 0x11;         // configures RC6 & RC7 as outputs
          LATC = 0x40;          // start footswitch detection with RC7 low and RC6 high
          status &= ~STATUS_USB_PRESENT;

          putch1('?');
       }
       if (new_command != 0)
       {
         if ((status & STATUS_UNIT_ON) == 0)
         {
         //  oled_blank();
           status &= ~STATUS_OUTPUT_ON;
         }
         else
         {
           current_limit = climit[power_setting];
           oled_digits (power_setting * 10);
         }
       }
       if ((new_command=='#')||(new_command=='*')) new_command = 0;  // clear buffer to allow repeated PC commmands
       crlf1();
       rxchar_index = 0;
     }
     VREFCON2bits.DACR = 0x00; // DAC = 32A!!!
  }

// should never get here!!
}


void check_footswitch (void)
{
  // disable serial port if USB not plugged in!

   if ((status & STATUS_FSWITCH_PRESENT) == 0)  // dont check for USB if footswitch has been detected
   {
     if ((status & STATUS_USB_PRESENT) == 0)   // dont check again for USB if already detected
     {
       if ((adc_RC6 > 800) && (adc_RC7 > 40))
       {
         status |= STATUS_USB_PRESENT;
         TRISC = 0x91;       // RC7, RC4 as inputs  also RC0
         TXSTA1bits.TXEN = 1;  // enable Tx1
         RCSTA1bits.SPEN = 1;  // enable serial port & configures RC6 & RC7 as TX1 & RX1
       }
     }
   }
#ifdef PLUS
#else // no footswitch on PLUS
   if ((status & STATUS_USB_PRESENT) == 0)
   {
     if (adc_RC6 < 800)
     {
       PORTCbits.RC7 = 1;       // set RC7=high so pressed can be checked
       status |= STATUS_FSWITCH_PRESENT;
       if (adc_RC7 < 800)
       {
         status |= STATUS_FSWITCH_PRESSED;
       }
       else
       {
         status &= ~STATUS_FSWITCH_PRESSED;
       }
     } else
     {
       PORTCbits.RC7 = 0;     // footswitch not present so dont check for pressed
       status &= ~(STATUS_FSWITCH_PRESENT | STATUS_FSWITCH_PRESSED);
     }
   }
#endif
}


void print1_nvsysdata(void)
{
unsigned char loopy;

  crlf1();
  putch1 ('V');
  send1_ui(VERSION);
  crlf1();
  for (loopy = NV_ADD_START; loopy <= NV_ADD_END; loopy += 2)
  {
    send1_ui (nv_read(loopy));
    putch1(',');
    if ((loopy & 0x0e) == 0x0e) crlf1();
  }
  crlf1();
}


void print1_nvdata(void)
{
unsigned char loopy;
unsigned char nvbase;

  crlf1();
  putch1 ('V');
  send1_ui(VERSION);
  crlf1();
  for (loopy = NV_ADD_POWERUPS; loopy <= NV_ADD_ERROR4; loopy += 2)
  {
    send1_ui (nv_read(loopy));
    putch1(',');
    if ((loopy & 0x0e) == 0x0e) crlf1();
  }
  nvbase = NV_ADD_CLEANING;
  for (loopy = 0; loopy <= 0x08; loopy += 2)
  {
    send1_ui (nv_read(nvbase + loopy));
    putch1(',');
  }
  crlf1();
  nvbase = NV_ADD_POLISHING;
  for (loopy = 0; loopy <= 0x08; loopy += 2)
  {
    send1_ui (nv_read(nvbase + loopy));
    putch1(',');
  }
  crlf1();
  nvbase = NV_ADD_MANUAL;
  for (loopy = 0; loopy <= 0x06; loopy += 2)
  {
    send1_ui (nv_read(nvbase + loopy));
    putch1(',');
  }
  crlf1();
  nvbase = NV_ADD_MARK5;
  for (loopy = 0; loopy <= 0x06; loopy += 2)
  {
    send1_ui (nv_read(nvbase + loopy));
    putch1(',');
  }
  crlf1();
  nvbase = NV_ADD_MARK10;
  for (loopy = 0; loopy <= 0x06; loopy += 2)
  {
    send1_ui (nv_read(nvbase + loopy));
    putch1(',');
  }
  crlf1();
  nvbase = NV_ADD_MARK15;
  for (loopy = 0; loopy <= 0x06; loopy += 2)
  {
    send1_ui (nv_read(nvbase + loopy));
    putch1(',');
  }
  crlf1();
}




void oled_digits (unsigned char nums)
{
 nums = nums % 400; // ensure not more than 99 to fit screen
 putch2 (mode);
 putch2 ('0' + (nums/10));
putch2 ('0' + (nums%10));
 
