and88x/PIC-MikroC-Assembler/Allegro ACS758 Current Sensor C18/Allegro_ACS758_PIC18F45K22.c
}





void do_adc (void)
{
unsigned int adc_sample;
// converts RA2=AN2,RB1=AN10,RB2=AN8,RC4=AN16,RC6=AN18,RC7=AN19 in sequence
// if interrupt happens between calls then conversion is restarted
  while (ADCON0bits.GO != 0) ;   // wait here for conversion complete - (<4us)
  adc_invalid_flag = 0;          // clear flag - sample is always be OK
  adc_sample = (unsigned int)((ADRESH & 0x03) << 8);
  adc_sample += (unsigned int)(ADRESL);  // adc_sample is in range 0-0x3ff
  if (ADCON0bits.CHS == 2)  // if RA2 i.e. current sensor
  {
    if (adc_invalid_flag == 0) // got right thru conversion without interrupt
    {
       adc_RA2 = adc_sample;
       if (adc_sample >= 0x01ff) adc_sample -= 0x01ff;
       else adc_sample = (0x01ff - adc_sample);
       if (BRIDGE_IS_OFF)
       {
         if (bridge_off_flag != 0)
         {
            // if here then bridge has not been enabled between last two current samples
           if (adc_sample > CURRENT_THRESHOLD) // so current over 2A approx is fault
           {
             faults |= FAULT_BRIDGE;   // significant current should not flow when bridge is off!
           }
         }
         if (BRIDGE_IS_OFF)
         {
           bridge_off_flag = 1;  // set flag for checking after next current sample
         }
         if (BRIDGE_IS_OFF)  // check bridge is still  off..
         {
         }
         else
         {
           bridge_off_flag = 0;  // otherwise clear flag to avoid interrupt race hazard
         }
       }
       else
       {
           bridge_off_flag = 0;
       }
    }
    adc_invalid_flag = 0;
    ADCON0bits.CHS = 10;  // select RB1 (=AN10) for next conversion
    ADCON0bits.GO = 1;
  }
  else if (ADCON0bits.CHS == 10)  // if thermistor #1 on RB1 (=AN10)
  {   //  TH1 can be bonded to a component and plugged in to protect from exceeding 80C
    if (adc_invalid_flag == 0)
    {
      adc_RB1 = adc_sample;
      if (adc_sample < CELCIUS_80)
      {
          faults |= FAULT_TEMP1;
          faultcount = 4000;   // FAULT LED ON FOR 1s
      }
    }
    adc_invalid_flag = 0;
    ADCON0bits.CHS = 8;  // select RB2 (=AN8) for next conversion
    ADCON0bits.GO = 1;
  }
  else if (ADCON0bits.CHS == 8)  // if thermistor #2 on RB2 (=AN8)
  {     //  TH2 can be bonded to a component and plugged in to protect from exceeding 80C
    if (adc_invalid_flag == 0)
    {
      adc_RB2 = adc_sample;
      if (adc_sample < CELCIUS_80)
      {
          faults |= FAULT_TEMP2;
          faultcount = 4000;   // FAULT LED ON FOR 1s
      }
    }
    adc_invalid_flag = 0;
    ADCON0bits.CHS = 16;  // select RC4 (= AN16) for next conversion
    ADCON0bits.GO = 1;
  }
  else if (ADCON0bits.CHS == 16)  // if thermistor #3 on RC4 (=AN16)
  {     // check PCB in vicinity of MOSFETs
    if (adc_invalid_flag == 0)
    {
      adc_RC4 = adc_sample;
      if (adc_sample < TH3_CELCIUS_80)
      {
          faults |= FAULT_TEMP3;
          faultcount = 4000;   // FAULT LED ON FOR 1s
      }
    }
    adc_invalid_flag = 0;
    ADCON0bits.CHS = 18;  // select RC6 (=AN18) for next conversion
    ADCON0bits.GO = 1;
  }
  else if (ADCON0bits.CHS == 18)  // if RC6 (=AN18)
  {     // check for footswitch / USB
    if (adc_invalid_flag == 0)
    {
      adc_RC6 = adc_sample;
    }
    adc_invalid_flag = 0;
    ADCON0bits.CHS = 19;  // select RC7 (=AN19) for next conversion
    ADCON0bits.GO = 1;
  }
  else if (ADCON0bits.CHS == 19)  // if RC7 (=AN19)
  {     // check for footswitch / USB
    if (adc_invalid_flag == 0)
    {
      adc_RC7 = adc_sample;
    }
    adc_invalid_flag = 0;
    ADCON0bits.CHS = 2;  // select RA2 (=AN2) for next conversion
    ADCON0bits.GO = 1;
  }
  else
  {
    adc_invalid_flag = 0;
    ADCON0bits.CHS = 2;  // select channel 2 for next conversion
    ADCON0bits.GO = 1;
  }
}


void print1_error(void)
{
static unsigned char previous_errorno;

  errorno = faults;     // send fault telltale
  if (previous_errorno != errorno)
  {
    if (faults & (FAULT_BRIDGE|FAULT_ZERO|FAULT_CURRENT))
    {
      if (faults & FAULT_BRIDGE) putch1 ('B'); // Bridge
      if (faults & FAULT_ZERO)   putch1 ('Z'); // Zero
      if (faults & FAULT_CURRENT) putch1 ('A'); // Amps
      crlf1();
    }
    previous_errorno = errorno;
    crlf1();
    putch1('*');
    putch1('*');
    putch1('*');
    putch1('*');
    putch1('E');
    putch1(':');
    send1_ui(errorno);
    putch1('*');
    putch1('*');
    putch1('*');
    putch1('*');
    crlf1();
  }

  if (sampleno != 0)
  {
    putch1('L');
    send1_ui(sampleno);
    putch1(',');
    send1_ui(sample);
    crlf1();
    sampleno = 0;
  }
}


void print1_adcs (void)
{  // send the recent adcs

  if (printing != 0)
  {
    send1_ui (adc_RA2);
    putch1(',');
    send1_ui (adc_RB1);
    putch1(',');
    send1_ui (adc_RB2);
    putch1(',');
    send1_ui (adc_RC4);
    putch1(',');
    send1_ui (adc_RC6);
    putch1(',');
    send1_ui (adc_RC7);
    crlf1();
  }
}


void print1_current(void)
{  // sum the last 40 instantaneous currents
unsigned int int_current;
unsigned int temp[80];
unsigned char loop;

 if (printing != 0)
 {
  int_current = 0;
  for (loop = 0; loop < 40; loop++)
  {
     temp[loop] = current[loop];
  }

  for (loop = 0; loop < 40; loop++)
  {
     int_current += temp[loop];
     send1_ui(temp[loop]);
     putch1(',');
  }
  send1_ui(int_current);
  if ((status & STATUS_CURRENT_LIMITING) != 0)
  {
     status &= ~STATUS_CURRENT_LIMITING;
     putch1(':');
     putch1('L');
  }
  crlf1();
 }
}


void delayms (unsigned char millis)
{
unsigned char chump;
  CLRWDT();    // kick dog (xc.h)
  chump = millis / 64;
  while (chump != 0)
  {
     CLRWDT();    // kick dog (xc.h)
     timeout = 255;
     while (timeout)   ;
     chump -= 1;
  }
  timeout = ((millis % 64) * 4);
  while (timeout)   ;

}

void check_keypad (void)
{
static unsigned char strobe;

unsigned char now_key;
static unsigned char release_countdown;

  now_key = 0;
  if (strobe == 0x01)
  {
    if (PORTBbits.RB3 == 0)
    {
        now_key = '?';      // No key
    }
    else if (PORTBbits.RB4 == 0)
    {
        now_key = 'M'; // Mark
    }
    else if (PORTBbits.RB5 == 0)
    {
        now_key = 'L'; // Lower
    }
    strobe = 0x02;
  }
  else if (strobe == 0x02)
  {
    if (PORTBbits.RB3 == 0)
    {
        now_key = 'C';      // Clean
    }
    else if (PORTBbits.RB4 == 0)
    {
        now_key = 'P'; // Polish
    }
    else if (PORTBbits.RB5 == 0)
    {
        now_key = '?'; // No key
    }
    strobe = 0x04;
  }
  else if (strobe == 0x04)
  {
    if (PORTBbits.RB3 == 0)
    {
        now_key = 'T';       //ToggleOnOff
    }
    else if (PORTBbits.RB4 == 0)
    {
        now_key = '?';   // No key
    }
    else if (PORTBbits.RB5 == 0)
    {
        now_key = 'H';  //Higher
    }
    strobe = 0x01;
  }
  else strobe = 0x01;

  if (now_key == 0)
  {
    if (release_countdown > 0) release_countdown --;
    else new_key = 0;
  }
  else
  {
    release_countdown = 4;
    new_key = now_key;
  }

  PORTDbits.RD5 = 0;
  PORTAbits.RA6 = 0;
  PORTDbits.RD7 = 0;  // all LEDs off before changing strobe
  strobe &= 0x07;
  LATE = ((LATE & ~0x07) | strobe);  // drive strobe outputs ready for reading next time

  if (strobe == 1)  // now set front panel LEDs
  {
    if (((faults & FAULT_HARDWARE) && (ms64 & FLASH2Hz)) || (mode == MODE_POLISHING))
    {
        PORTDbits.RD5 = 1; // Polish LED on
    }
#ifdef PLUS
    if (((faults & FAULT_HARDWARE) && (ms64 & FLASH2Hz)) || (mode == MODE_MANUAL))
    {
      PORTAbits.RA6 = 1;  // PLUS uses Mark5 LED to show MARKING mode
    }
#else
    if (((faults & FAULT_HARDWARE) && (ms64 & FLASH2Hz)) ||
         ((faults & FAULT_FSWITCH) && (ms64 & FLASH1Hz)) || (mode == MODE_MARK5))
    {
        PORTAbits.RA6 = 1;  //Mark5 LED on
    }
#endif
    if (((faults & FAULT_HARDWARE) && (ms64 & FLASH2Hz)) ||
            ((faults & FAULT_FSWITCH) && (ms64 & FLASH1Hz)) || (mode == MODE_MARK10))
    {
         PORTDbits.RD7 = 1;  //Mark10 LED on
    }
  }
  else if (strobe == 2)
  {
    if (((faults & FAULT_HARDWARE) && (ms64 & FLASH2Hz)) || (mode == MODE_CLEANING))
    {
        PORTDbits.RD5 = 1;  // Clean LED on
    }
    if (((faults & FAULT_HARDWARE) && (ms64 & FLASH2Hz)) ||
            ((faults & FAULT_FSWITCH) && (ms64 & FLASH1Hz)) || (mode == MODE_MARK15))
    {
         PORTDbits.RD7 = 1; //Mark15 LED on
    }
  }
  else if (strobe == 4)
  {
    if (((faults & (FAULT_HARDWARE|FAULT_OVERTEMP|FAULT_CURRENT)) && (ms64 & FLASH2Hz))
            || ((status & STATUS_UNIT_ON) == 0))
    {
        PORTDbits.RD5 = 1; // Standby LED on
    }
    if (((faults & FAULT_HARDWARE) && (ms64 & FLASH2Hz)) ||
        ((faults & FAULT_FSWITCH) && (ms64 & FLASH1Hz)) ||
        ((mode & MODE_MARKING) && ((status & STATUS_TIMER_ACTIVE) && (ms64 & FLASH1Hz))) ||
        ((mode == MODE_MANUAL) && (status & STATUS_TIMER_ACTIVE) == 0))
    {
        PORTDbits.RD7 = 1;  // Manual Marking LED on
    }
  }
}

void nv_save_mode (void)
{
#ifdef PLUS
    if ((mode > MODE_MANUAL) && (mode <= MODE_MARK15)) mode = MODE_MANUAL; // only valid marking mode for PLUS
#endif
    nv_write (NV_ADD_MODE,(unsigned int)(mode));
    if ((mode >= MODE_MANUAL) && (mode <= MODE_MARK15))
    {
        nv_write (NV_ADD_MARKMODE,(unsigned int)(mode));
    }
}

