and88x/PIC-MikroC-Assembler/Allegro ACS758 Current Sensor C18/Allegro_ACS758_PIC18F45K22.c
void nv_restore_mode (void)
{    // restore most recently used mode
    mode = (unsigned char)(nv_read(NV_ADD_MODE));
#ifdef PLUS
    if ((mode != 'C') && (mode != 'P') && (mode != MODE_MANUAL))
    {
        mode = 'C';  // ensure restored mode is valid (if not Polishing or Marking must be Cleaning)
        nv_save_mode();
    }
#else
    if ((mode != 'C') && (mode != 'P') && ((mode < MODE_MANUAL) || (mode > MODE_MARK15)))
    {
        mode = 'C';  // ensure restored mode is valid (if not Polishing or Marking must be Cleaning)
        nv_save_mode();
    }
#endif
}

void nv_restore_marking_mode (void)
{           // restore most recently used Marking mode
#ifdef PLUS
    mode = MODE_MANUAL;  // PLUS so only marking mode available
#else
    mode = (unsigned char)(nv_read(NV_ADD_MARKMODE));
    if ((mode != MODE_MARK5) && (mode != MODE_MARK10) && (mode != MODE_MARK15))
    {
        mode = MODE_MANUAL;  // ensure marking mode is valid, not Mark1 or Mark2 or Mark3 so must be Manual
    }
#endif
}

void nv_save_power (void)
{
    if (mode == MODE_CLEANING)       nv_write (NV_ADD_CPOWER,((unsigned int)(power_setting)));
    else if (mode == MODE_POLISHING) nv_write (NV_ADD_PPOWER,((unsigned int)(power_setting)));
    else if (mode == MODE_MANUAL)    nv_write (NV_ADD_M0POWER,((unsigned int)(power_setting)));
    else if (mode == MODE_MARK5)     nv_write (NV_ADD_M1POWER,((unsigned int)(power_setting)));
    else if (mode == MODE_MARK10)    nv_write (NV_ADD_M2POWER,((unsigned int)(power_setting)));
    else if (mode == MODE_MARK15)    nv_write (NV_ADD_M3POWER,((unsigned int)(power_setting)));
    // if not a valid mode then do nothing...
}

void nv_restore_power (void)
{
    if (mode == MODE_CLEANING)        power_setting =(unsigned char)(nv_read (NV_ADD_CPOWER));
    else if (mode == MODE_POLISHING)  power_setting =(unsigned char)(nv_read (NV_ADD_PPOWER));
    else if (mode == MODE_MANUAL)     power_setting =(unsigned char)(nv_read (NV_ADD_M0POWER));
    else if (mode == MODE_MARK5)      power_setting =(unsigned char)(nv_read (NV_ADD_M1POWER));
    else if (mode == MODE_MARK10)     power_setting =(unsigned char)(nv_read (NV_ADD_M2POWER));
    else if (mode == MODE_MARK15)     power_setting =(unsigned char)(nv_read (NV_ADD_M3POWER));
    else power_setting = 1;
    // if not a valid mode then set power to zero...
    if (power_setting > MAX_POWER) power_setting = 1;    // ensure power_setting is valid (1-MAX_POWER)
    if (power_setting == 0) power_setting = 1;          // ensure power_setting is valid (1-MAX_POWER)
}


void nv_check (void)
{
unsigned int nv_data;
  nv_data = nv_read(NV_ADD_POWERUPS);
  nv_data += 1;
  nv_write (NV_ADD_POWERUPS,nv_data);
  send1_ui(nv_data);
  crlf1();
  nv_data -= nv_read(NV_ADD_POWERUPS);
  if (nv_data != 0) errorstate = ERROR_BAD_NV;
  else // nv writes OK so carry on
  {
    nv_data = nv_read(NV_ADD_VIRGIN);
    if (nv_data != NV_VIRGIN_DATA)
    {
      nv_data = NV_VIRGIN_DATA;
      nv_write (NV_ADD_VIRGIN,nv_data);
      nv_data = nv_read(NV_ADD_VIRGIN);
      if (nv_data == NV_VIRGIN_DATA) nv_init();   // here if this is first powerup, so initialise nvdata
      else errorstate = ERROR_BAD_NV;
    }
    else
    {
        crlf1();
        send1_string(nvOK_string);
        crlf1();
    }
  }
}

void nv_init (void)
{
unsigned char loopy;

  crlf1();
  send1_string(nvinit_start_string);
  crlf1();
  for (loopy = NV_ADD_START; loopy <= NV_ADD_END; loopy += 2)
  {
    timeout = 200;                          // set 50ms timeout
    do
    {
      nv_write (loopy, 0x00);    // clear   NV
    }  while ((nv_read(loopy) != 0x00) && (timeout != 0));
  }
  nv_write (NV_ADD_VIRGIN,NV_VIRGIN_DATA);

  send1_string(nvinit_end_string);
  crlf1();
}

unsigned int nv_read (unsigned char nvadd)
{
// Reads 16-bit data from even nvadd in range 0 - 0xfe
unsigned int nv_data;
  EEADR = nvadd + 1;    // for 16bit access get high byte from next address
  EECON1bits.EEPGD = 0; // point to data
  EECON1bits.CFGS = 0;  // access eeprom not config
  EECON1bits.RD = 1;    // start read cycle
  nv_data = (unsigned int)EEDATA;
  nv_data = (nv_data << 8);
  EEADR = nvadd;
  EECON1bits.EEPGD = 0; // point to data
  EECON1bits.CFGS = 0;  // access eeprom not config
  EECON1bits.RD = 1;    // start read cycle
  nv_data += (unsigned int)EEDATA;
  return (nv_data);
}


void nv_write (unsigned char nvadd, unsigned int nvdata)
{
// Writes 16bit data to nvadd in range 0 - 0xfe
// first write high byte
  EEADR = nvadd + 1;        // for 16bit access store high byte at next address
  EEDATA = ((nvdata >> 8) & 0xff);
  EECON1bits.EEPGD = 0;     // point to data
  EECON1bits.CFGS = 0;      // access eeprom not config
  EECON1bits.WREN = 1;      // enable writes
  INTCONbits.GIE = 0;       // disable interrupts
  EECON2 = 0x55;            // unlock
  EECON2 = 0xAA;            // unlock
  EECON1bits.WR = 1;        // start writes cycle
  INTCONbits.GIE = 1;       // enable interrupts
  while (EECON1bits.WR == 1) ; //wait here for end of write cycle

  EEADR = nvadd;           // for 16bit access store low byte at specified address
  EEDATA = (nvdata & 0xff);
  EECON1bits.EEPGD = 0;     // point to data
  EECON1bits.CFGS = 0;      // access eeprom not config
  EECON1bits.WREN = 1;      // enable writes
  INTCONbits.GIE = 0;       // disable interrupts
  EECON2 = 0x55;            // unlock
  EECON2 = 0xAA;            // unlock
  EECON1bits.WR = 1;        // start writes cycle
  INTCONbits.GIE = 1;       // enable interrupts
  while (EECON1bits.WR == 1) ; //wait here for end of write cycle
  EECON1bits.WREN = 0;      // disable writes
}

void nv_increment (unsigned char nvadd)
{
unsigned int uitemp;
    uitemp = nv_read (nvadd);
    uitemp += 1;
    if (uitemp != 0)   // don't wrap back to zero
    {
      nv_write (nvadd,uitemp);
    }
}


//----------------------------------------------------------------------------



void putSP1 (unsigned char uc_out)
{
  putch2 (uc_out);
}


void putch1 (unsigned char uc_out)
{
  if (RCSTA1bits.SPEN == 1)   // dont try sending if serial port not enabled
  {
    timeout = 50;               // start 12ms timeout
    while (PIR1bits.TX1IF == 0) // wait while TSR and TXREG both busy
    {
      if (timeout == 0) break;  // don't wait forever
    }
    TXREG1 = uc_out;            // send it
  }
}


void putch2 (unsigned char uc_out)
{
  timeout = 50;               // start 12ms timeout
  while (PIR3bits.TX2IF == 0) // wait while TSR and TXREG both busy
  {
    if (timeout == 0) break;  // don't wait forever
  }
  TXREG2 = uc_out;            // send it
}

