and88x/PIC-MikroC-Assembler/Allegro ACS758 Current Sensor C18/Allegro_ACS758_PIC18F45K22.c
//___________________________________________________________________________


void crlf1(void)
{
  putch1(0x0d);
  putch1(0x0a);
}


void crlf2(void)
{
  putch2(0x0d);
  putch2(0x0a);
}


void OK (void)
{
  putch1('O');
  putch1('K');
}


void send1_string (const char *str)
{
unsigned char char_count;

  char_count = 0;
  while (char_count++ < 50)  // not forever
  {
    if ((*str=='\0')||(*str==0x0d)||(*str==0x0a)) break;
    putch1 ( *str++);
  }
}

void print1_si (signed int si_numb)
{                                       // send signed integer as string
unsigned int ui_number;
  if (si_numb < 0)
  {
    si_numb = -si_numb;
    putch2('-');
  }
  ui_number = (unsigned int)si_numb;
  send1_ui (ui_number);
}  


void send1_ui (unsigned int ui_numb)
{                                       // send unsigned integer as string to the serial port
unsigned int ui_p1, ui_p2;
  ui_p1 = ui_numb;
  if (ui_p1 > 999)
  {
    ui_p2 = ui_p1 / 10000;
    putch1((unsigned char)(0x30 | ui_p2));
    ui_p1 -= ui_p2 * 10000;
    ui_p2 = ui_p1 / 1000;
    putch1((unsigned char)(0x30 | ui_p2));
    ui_p1 -= ui_p2 * 1000;
  }
  ui_p2 = ui_p1 / 100;
  putch1((unsigned char)(0x30 | ui_p2));
  ui_p1 -= ui_p2 * 100;
  ui_p2 = ui_p1 / 10;
  putch1((unsigned char)(0x30 | ui_p2));
  ui_p1 -= ui_p2 * 10;
  putch1((unsigned char)(0x30 | ui_p1));
}

void print1_hex (unsigned char uc_numb)
{                                       // send unsigned char as hex pair to the serial port
unsigned char msh,lsh;

  msh = uc_numb / 16;                   // get ms decimal digit
  lsh = uc_numb - (msh << 4);           // get ls decimal digit
 
  msh += '0';                           // get ms ASCII digit
  lsh += '0';                           // get ls ASCII digit
 
  if (msh > '9') msh += 7;              // correct ms ASCII digit for A-F
  if (lsh > '9') lsh += 7;              // correct ls ASCII digit for A-F  
  putch1 (msh);
  putch1 (lsh);
}

void initialise (void)
{

// startup clock is default 1MHz internal clock, set to 16MHz:
  OSCCONbits.IRCF = 7;  // set internal clock to 16MHz
  OSCCONbits.OSTS = 0;  // select internal clock
  OSCCONbits.SCS = 2;   // system clock select
// converts RA2=AN2,RB1=AN10,RB2=AN8,RC4=AN16,RC6=AN18,RC7=AN19 in sequence
  ANSELA = 0x0F;  // RA3:0 all analog inputs
  LATA = 0x00;    
  TRISA = 0x0F;
// use RA2 = AN2 as ADC input channel for integrating current
  ADCON0bits.CHS = 2;  // select channel 2 tp measure current
  ADCON1bits.PVCFG = 0;   // select AVdd as +ve ref
  ADCON1bits.NVCFG = 0;   // select AVss as -ve ref
  ADCON2bits.ACQT = 2;   // max acquisition time (4us)
  ADCON2bits.ADCS = 5;   // ADC clock = Fosc/16 = 1MHz
  ADCON2bits.ADFM = 1;   // MS 2bits in ADRESH LS 8bits in ADRESL
  ADRESH = 0x80;        // start at half rail (zero current)
  ADCON0bits.ADON = 1;    // enable ADC

//configure DAC
  VREFCON1bits.DACNSS = 0;  // Vref- = Vss
  VREFCON1bits.DACPSS = 1;  // Vref+ = RA3 ext input (=2.5V)
  VREFCON2bits.DACR = 0x1f; // start DAC output almost at Vmax (=Vref+)
  VREFCON1bits.DACEN = 1;   // enable DAC
 
// configure comparator
  CM1CON0bits.C1CH = 0;   // C12IN0- connects to C1Vin- = RA0
  CM1CON0bits.C1R = 1;  // C1Vin+ connects to C1Vref
  CM1CON0bits.C1SP = 1;   // C1 operates in standard power mode
  CM1CON0bits.C1POL = 0;  //C1Out noninvert so C1Out HI when C1Vin+ > C1Vin-
  CM1CON0bits.C1OE = 0; // C1out doesn't connect to pin RA4
  CM1CON0bits.C1ON  = 1;  // C1 enabled

  CM2CON0bits.C2CH = 1;   // C12IN1- connects to C2Vin- = RA1
  CM2CON0bits.C2R = 1;  // C2Vin+ connects to C2Vref
  CM2CON0bits.C2SP = 1;   // C2 operates in standard power mode
  CM2CON0bits.C2POL = 0;  //C2Out noninvert so C2Out HI when C2Vin+ > C2Vin-
  CM2CON0bits.C2OE = 0; // C2out doesn't connect to pin RA5
  CM2CON0bits.C2ON  = 1;  // C2 enabled

  CM2CON1bits.C1RSEL = 0; // DAC output connects to C1Vref
  CM2CON1bits.C2RSEL = 0; // DAC output connects to C2Vref

  ANSELB = 0x06;  // RB2,1 analog thermistor inputs

// start with PortB all inputs with pullups except RB3
  LATB = 0x00;    //
  TRISB = 0xff;   // all of RBs are inputs, with each weak pup configured by WPUB bits

  WPUB = 0xf8;    // weak pullups on, except for RB0 (ZERO) and RB1,2 (thermistors)
  INTCON2bits.RBPU = 0; // enable pullups
  INTCON2bits.INTEDG0 = 1;  // Ext INT0 interrupts on rising edge of RB0
  INTCONbits.INT0IF = 0;   // clear Ext INT0 flag
  INTCONbits.INT0IE = 1;  // enable Ext INT0

  ANSELC = 0x10;  // RC4 analog thermistor input, RC0 digital debug op for now
// analog levels of RC6 & RC7 are converted but these are digital outputs
// for checking footswitch/USB present:  
  TRISC = 0x90;   // RC7=input for RX1,RC6=output, RC4 analog inputs
  LATC = 0x40;    // start with RC6=high, RC7=low
// RC3 is SCK1, RC4 is SPIN1 (not used), RC5 is SPOUT to OLED
// always setting TRIS bits for RX1 & TX1 is OK to use UART

  ANSELD = 0x00;
  LATD = 0x00;
  TRISD = 0x40;  // allow RD6 is TX2

  ANSELE = 0x00;
  TRISE = 0xf8;
  LATE = 0x00;    // RE0,RE1,RE2 low so STB0,STB1,STB2 are off

  IPEN = 0;     //interrupts compatible with pic16 etc
 
  TMR1CS1 = 0;  // T1 clock source = system clock
  TMR1CS0 = 1;  // T1 clock source = system clock
  TMR1GE = 0;
  TMR1ON = 1;
  TMR1IE = 1;   // enable Timer1 interrupts

  TMR3CS1 = 0;  // T3 clock source = system clock/4 = 4MHz
  TMR3CS0 = 0;  // T3 clock source = system clock/4 = 4MHz
  TMR3GE = 0;
  TMR3ON = 1;
  TMR3IE = 1;

  // setup UART1
  SPBRG1 = 34;    // divisor = 34 to set 115200baud
  SPBRGH1 = 0;
  TXSTA1bits.SYNC = 0;
  TXSTA1bits.BRGH = 1;
  BAUDCON1bits.BRG16 =1;
  RCSTA1bits.CREN = 1;  // enable RX1
  TXSTA1bits.TXEN = 1;  // enable Tx1
  RCSTA1bits.SPEN = 1;  // enable serial port & configures RC6 & RC7 as TX1 & RX1

  SPBRG2 = 0xa0;    // divisor = 416 to set 9600baud
  SPBRGH2 = 1;
  TXSTA2bits.SYNC = 0;
  TXSTA2bits.BRGH = 1;
  BAUDCON2bits.BRG16 =1;
  TXSTA2bits.TXEN = 1;  // enable TX2
  RCSTA2bits.SPEN = 1;  // enable serial port & configures RD6 as TX2

  PIE1bits.RC1IE = 1;     // enable RX1 interrupts
  putch1 ('k');  //for debugging
  putch1 ('k');
  putch1 ('k');
  putch1 ('k');
  putch1 ('k');
  putch1 ('k');
  putch1 ('k');
  putch1 ('k');
  putch1 ('k');
  putch1 ('k');
}


