and88x/PIC-MikroC-Assembler/Allegro ACS758 Current Sensor C18/Allegro_ACS758_PIC18F45K22.c
//____________________________________________________________________________

void interrupt low_priority lp_interrupt(void)
{
unsigned char loopit;
unsigned int ui_dummy;
unsigned int iadc_sample;

  LATC |= 0x04;  // RC2 high for debug    DEBUG
  adc_channel = ADCON0bits.CHS;   // save channel of background adc conversion
  ADCON0bits.GO = 0;  // ensure no adc conversion in progress
  adc_invalid_flag = 1;  // and flag invalid to background
  ADCON0bits.CHS = 2;  // select channel 2 for next conversion to measure current
  ADCON0bits.GO = 1;  // start conversion of current

  if (INT0IE && INT0IF)
  { // zero crossing interrupt, here at start of both half-cycles
    // this interrupt is on the rising edge of RB0
    // which is 400us approx before the falling edge of the AC input to the opto
    // sometimes get a glitch on RB0 which gives a rising edge interrupt on both edges
    // so use a filtered version of RB0 level to decide which is rising edge
    if (filteredRB0 < 0)  // RB0 was low so this must be rising edge
    {
      zero_cross_timeout = 100;    // should never exceed 25ms without zero crossing
      TMR3 = 64100;    // set TMR3 to interrupt in 360us
      rising_edge_flag = 1; // flag to Timer3 int that Power1 is rising ref Power3
    }
    INT0IF = 0;    // clear flag
  }


  if (TMR3IE && TMR3IF)
  { // here at AC zero crossings with rising_edge_flag set if Power1 is rising ref Power3
    TMR3 = 25536;   // interrupt after 10ms = 40000 cycles of 4MHz
    if (rising_edge_flag)
    {
      LATC |= 0x08;   // set if Power1 is rising ref Power3
    }
    else  LATC &= ~0x08;

    current_index = 0;
    current_total = 0;
    TMR1 = 0xfffe;    // ensure we get TMR1 interrupt now

    BRIDGE_OFF;
    RED_LED_OFF;

    if ((mode == 'C') || (mode & MODE_MARKING)) //v21 relay off (ac) for Cleaning or Marking
    {
      RELAYS_OFF;
    } else
    {
      RELAYS_ON;       // keep relay on even when in standby to prevent output leakage
    }

    if (inhibit_count) inhibit_count -= 1;  // countdown for fault LED

    if (((status & STATUS_OUTPUT_ON) != 0) && (current_limit != 0) && (inhibit_count == 0)) // don't enable bridge if limit is zero
    {
#ifdef PLUS
      if ((mode == 'C') || (mode == 'P') || (mode & MODE_MARKING))  // PLUS so marking timer not used
#else
      if ((mode == 'C') || (mode == 'P') || ((mode & MODE_MARKING) && (status & STATUS_TIMER_ACTIVE)))
#endif
      {
        if (mode == 'P')   //
        {
          if (rising_edge_flag == 1) // if Power1 is rising relative to Power3
          {
            LEFT_BOT_ON;
            RIGHT_TOP_ON;
          }
          else
          {
            LEFT_TOP_ON;
            RIGHT_BOT_ON;
          }
        }
        BRIDGE_ON;
        RED_LED_ON;
      }
    }
    rising_edge_flag = 0;  // next time around Power1 not rising relative to Power3
    TMR3IF = 0;   // clear int flag
  }


  if (TMR1IE && TMR1IF)
  {   // here every 0.25ms, ready to update LED telltales and digits
    ui_dummy = TMR1;
    ui_dummy -= 4000;
    TMR1 = ui_dummy;  // interrupt after 250us = 4000 cycles of 16MHz
    us250counter += 1;
    if ((us250counter & 0x003) == 0)
    {
        mscounter ++;
        if ((mscounter & 0x3f) == 0)
        {
            ms64++;
            if (mscounter == 0)
            {
                ms256_counter++;
                if (ms256_counter == 234)  // 234 * 0.256 = 60s approx
                {
                    ms256_counter = 0;
                    minute_flag = 1;
                }
            }
        }
    }

    if (zero_cross_timeout) zero_cross_timeout -= 1;
    else
    {
      BRIDGE_OFF;
      RED_LED_OFF;
     // faults |= FAULT_ZERO;
    }

    while (ADCON0bits.GO != 0) ;   // wait here for conversion to complete

    iadc_sample = (unsigned int)((ADRESH & 0x03) << 8);
    iadc_sample += (unsigned int)(ADRESL);  // adc_sample is in range 0-0x3ff            //ukupan semple magnitude je 1023 (3ff)

    ADCON0bits.CHS =  adc_channel;   // restore channel of background adc conversion
    ADCON0bits.GO = 1;               // and restart conversion for background task
// iadc_sample is 0 - 0x3ff, current flowing is zero at midrange
    if (iadc_sample >= 0x0200) iadc_sample -= 0x0200;   // 0x0200 je 512
    else iadc_sample = (0x01ff - iadc_sample);          // current magnitude is 0 - 0x1ff magnitude is 511(1ff)

    current_sample = iadc_sample; // save in current_sample

    if (current_sample > MAX_CURRENT_SAMPLE)
    {  // if rising too far or too fast
       // with leads shorted we reach this current at index = 5 or 6
      BRIDGE_OFF;
      RED_LED_OFF;
      status |= STATUS_CURRENT_LIMITING;
      faults |= FAULT_CURRENT;  // current too high too soon
      inhibit_count = 3;   // inhibit next two cycles
      faultcount = 400;   // LED on for a while
      if (sampleno == 0)  // snatch first overcurrent sample for later analysis
      {
        sampleno = current_index;
        sample = current_sample;
      }
    }
    current[current_index] = current_sample;  // save for printing in debug

//   calculate RMS
    current_sample = (current_sample * 9); //scale to max 4599 (avoid slow integer divides)
    current_sample = (current_sample >> 6); //scale to max 71 so squared max is 5041
    current_sample = (current_sample * current_sample);
    current_total += current_sample;       // prev summed sample, now sum squares

    if (current_total > current_limit)
    {
      current_total = 60001;  // > highest limit of 60000, ensure next total < 65330
      BRIDGE_OFF;
      RED_LED_OFF;
    }

    if (current_index++ > 39) current_index = 39;

    if (faultcount) faultcount -= 1;  // countdown for fault LED
    if (keypadcount) keypadcount -= 1;  // countdown for keyscan
    else
    {
      keypadcount = 16;
      check_keypad();
    }

    if (timeout) timeout -= 1;      // universal timout to stop infinite loops

    if (PORTBbits.RB0 == 0) filteredRB0--;
    else filteredRB0++;
    if (filteredRB0 < -5) filteredRB0 = -5;
    if (filteredRB0 > 5) filteredRB0 = 5;

    TMR1IF = 0;
  }

  if (RC1IE && RC1IF)
  {   // if RX1 ints enabled and char received
//
// fetches received characters from U1RXBUF and puts them into buffer rx_char[]
//
    rxchar_index += 1;
    rxchar_index &= 0x0f;              // limit to 16 char buffer
    rxchar[rxchar_index] = RCREG1;
    RC1IF = 0;
  }
  LATC &= ~0x04;  // RC2 low for debug    DEBUG
}

//oled version i oled hello izbrisani
//fault zero iskljucen
//power settings ti je samo broj od 0 do 20, isto je sto i max power i samo ti cita vrednosti od climit
// TXSTA1bits.TXEN = 1;  // vrednosti su stavljene na 1 a bile su 0 
// RCSTA1bits.SPEN = 1;     vrednosti su stavljene na 1 a bile su 0 enable serial1 tako da salje podatke
// linija 11 #pragma config CP = ON vidi koje je resenje da dodas code ptotection da se to automatski zastiti
//#pragma config CP = ON  dodato ali ne radi
// unete vrednosti ispod climit kao komentari od 0 do 50A cisto zbog preglednosti
//printing = 1; da citamo malo podatke